insert into patients(id, last_name, name, patronymic, date_of_birthday, phone_number, place_of_work, home_address, email, policy_number, insurance_company)
values
    (1, 'Петров', 'Петр', 'Петрович', '11.11.1981', 89004455667, 'ООО Движение', 'Москва, ул. Веселая, д.4, кв.72', 'pertovichPP@mail.ru', 111222333, 'Альфа-страхование'),
    (2, 'Семенов', 'Семен', 'Семенович', '05.01.1987', 89064655677, 'ОАО Сервис', 'Москва, ул. Липецкая, д.23, кв.89', 'semenovSS@mail.ru', 111222444, 'Альфа-страхование'),
    (3, 'Иванов', 'Иван', 'Иванович', '09.09.1976', 89024440067, 'ООО Магнит', 'Москва, ул. Бакинская, д.10, кв.166', 'ivanovII@mail.ru', 111222555, 'СОГАЗ-Мед');

insert into doctors(id, last_name, name, patronymic, specialization, cabinet_number)
values
    (1, 'Иванова', 'Анна', 'Григорьевна', 'Терапевт', 202),
    (2, 'Юсупова', 'Виктория', 'Николаевна', 'Кардиолог', 210),
    (3, 'Федотов', 'Марат', 'Вениаминович', 'Окулист', 303),
    (4, 'Белкин', 'Юрий', 'Степанович', 'Оториноларинголог', 312);

insert into hospitals(id, hospital_name, hospital_address, hospital_phone)
values
    (1, 'Больница №83 ФНКЦ ФМБА России', 'г.Москва, Ореховый бульвар, д. 28', 84951524758),
    (2, 'Университетская клиническая больница №4 Сеченова', 'г.Москва, ул. Доватора, д. 15/1', 84992292290),
    (3, 'Городская клиническая больница имени С.С. Юдина', 'г.Москва, Коломенский пр., 4', 84996124566),
    (4, 'Городская клиническая больница имени В.М. Буянова', 'г.Москва, Бакинская ул., 26,', 84951362268);

create table if not exists visits(id, data_time_of_the_visit, doctor_id, hospital_id, patient_id);

insert into visits(id, date_time_of_the_visit, doctor_id, hospital_id, patient_id)
values
    (1, '02.03.2024 08:00', 1, 2, 3),
    (2, '02.03.2024 09:00', 2, 3, 1),
    (3, '03.03.2024 10:15', 3, 1, 2);